In [1]:
people={'first':['jhon','peter','smith'],
        'last':['kevin','son','steve'],
         'email':['jhon@gmail.com','peter@gmail.com','smith@gmail.com']}

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(people)

In [4]:
df

   first   last            email
0   jhon  kevin   jhon@gmail.com
1  peter    son  peter@gmail.com
2  smith  steve  smith@gmail.com

In [5]:
df['first']+' '+df['last']

0     jhon kevin
1      peter son
2    smith steve
dtype: object

In [6]:
df['full name']=df['first']+' '+df['last']

In [7]:
df

   first   last            email    full name
0   jhon  kevin   jhon@gmail.com   jhon kevin
1  peter    son  peter@gmail.com    peter son
2  smith  steve  smith@gmail.com  smith steve

In [11]:
df.drop(['first','last'], axis=1, inplace=True)

In [12]:
df

             email    full name
0   jhon@gmail.com   jhon kevin
1  peter@gmail.com    peter son
2  smith@gmail.com  smith steve

In [13]:
df[['first','last']]=df['full name'].str.split(' ', expand=True)

In [14]:
df

             email    full name  first   last
0   jhon@gmail.com   jhon kevin   jhon  kevin
1  peter@gmail.com    peter son  peter    son
2  smith@gmail.com  smith steve  smith  steve

In [15]:
df.columns

Index(['email', 'full name', 'first', 'last'], dtype='object')

In [18]:
df[['first', 'last','email', 'full name']]

   first   last            email    full name
0   jhon  kevin   jhon@gmail.com   jhon kevin
1  peter    son  peter@gmail.com    peter son
2  smith  steve  smith@gmail.com  smith steve

In [19]:
df=df[['first', 'last','email', 'full name']]

In [20]:
df

   first   last            email    full name
0   jhon  kevin   jhon@gmail.com   jhon kevin
1  peter    son  peter@gmail.com    peter son
2  smith  steve  smith@gmail.com  smith steve

In [22]:
df.append({'first':'drew'}, ignore_index=True)

   first   last            email    full name
0   jhon  kevin   jhon@gmail.com   jhon kevin
1  peter    son  peter@gmail.com    peter son
2  smith  steve  smith@gmail.com  smith steve
3   drew    NaN              NaN          NaN

In [23]:
people={'first':['alex','ian'],
        'last':['joe','root'],
         'email':['alex@uk.com','adil@uks.com']}

In [24]:
df2=pd.DataFrame(people)

In [25]:
df2

  first  last         email
0  alex   joe   alex@uk.com
1   ian  root  adil@uks.com

In [39]:
df.append(df2, ignore_index=True, sort= True)

             email  first    full name   last
0   jhon@gmail.com   jhon   jhon kevin  kevin
1  peter@gmail.com  peter    peter son    son
2  smith@gmail.com  smith  smith steve  steve
3      alex@uk.com   alex          NaN    joe
4     adil@uks.com    ian          NaN   root

In [41]:
df.append(df2, ignore_index=True, sort= True)

             email  first    full name   last
0   jhon@gmail.com   jhon   jhon kevin  kevin
1  peter@gmail.com  peter    peter son    son
2  smith@gmail.com  smith  smith steve  steve
3      alex@uk.com   alex          NaN    joe
4     adil@uks.com    ian          NaN   root

In [42]:
df.ind

   first   last            email    full name
0   jhon  kevin   jhon@gmail.com   jhon kevin
1  peter    son  peter@gmail.com    peter son
2  smith  steve  smith@gmail.com  smith steve